Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper
The Tekla Structures settings helper class

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.GetAdvancedOptionPaths(System.String,System.Collections.Generic.List{System.String}@,Tekla.Structures.TeklaStructuresSettings.InvalidPathCallback)
Gets the value of an advanced option as a list of valid paths.
advancedOption: The advanced option name.
paths: The paths.
errorHandler: The optional error handler callback.
Returns:
True if the variable is read successfully and contains no invalid paths; otherwise false.